export const METRO_LINES = [
  {
    name: 'Холодногірсько-Заводська лінія',
    color: 'text-red-500',
    stations: [
      { label: 'Холодна гора', value: 'Холодная гора' },
      { label: 'Вокзальна', value: 'Вокзальная' },
      { label: 'Центральний ринок', value: 'Центральный рынок' },
      { label: 'Майдан Конституції', value: 'Площадь Конституции' },
      { label: 'Левада', value: 'Левада' },
      { label: 'Спортивна', value: 'Спортивная' },
      { label: 'Заводська', value: 'Заводская' },
      { label: 'Турбоатом', value: 'Турбоатом' },
      { label: 'Палац Спорту', value: 'Дворец Спорта' },
      { label: 'Армійська', value: 'Армейская' },
      { label: 'Ім. О. С. Масельського', value: 'Им. А. С. Масельского' },
      { label: 'Тракторний завод', value: 'Тракторный завод' },
      { label: 'Індустріальна', value: 'Индустриальная' }
    ]
  },
  {
    name: 'Салтівська лінія',
    color: 'text-blue-500',
    stations: [
      { label: 'Історичний музей', value: 'Исторический музей' },
      { label: 'Університет', value: 'Университет' },
      { label: 'Ярослава Мудрого', value: 'Ярослава Мудрого' },
      { label: 'Київська', value: 'Киевская' },
      { label: 'Академіка Барабашова', value: 'Академика Барабашова' },
      { label: 'Академіка Павлова', value: 'Академика Павлова' },
      { label: 'Студентська', value: 'Студенческая' },
      { label: 'Салтівська', value: 'Салтовская' }
    ]
  },
  {
    name: 'Олексіївська лінія',
    color: 'text-green-500',
    stations: [
      { label: 'Метробудівників', value: 'Метростроителей' },
      { label: 'Захисників України', value: 'Защитников Украины' },
      { label: 'Архітектора Бекетова', value: 'Архитектора Бекетова' },
      { label: 'Держпром', value: 'Госпром' },
      { label: 'Наукова', value: 'Научная' },
      { label: 'Ботанічний сад', value: 'Ботанический сад' },
      { label: '23 Серпня', value: '23 Августа' },
      { label: 'Олексіївська', value: 'Алексеевская' },
      { label: 'Перемога', value: 'Победа' }
    ]
  }
]

export const DISTRICTS = [
  { value: 'Алексеевка', label: 'Олексіївка' },
  { value: 'Бавария', label: 'Баварія' },
  { value: 'Гагарина', label: 'Гагаріна' },
  { value: 'Горизонт', label: 'Горизонт' },
  { value: 'Жуковского', label: 'Жуковського' },
  { value: 'Залютино', label: 'Залютине' },
  { value: 'Москалевка', label: 'Москалівка' },
  { value: 'Немышля', label: 'Немишля' },
  { value: 'Новая Бавария', label: 'Нова Баварія' },
  { value: 'Новые Дома', label: 'Нові Будинки' },
  { value: 'Одесская', label: 'Одеська' },
  { value: 'Основа', label: 'Основа' },
  { value: 'Павлово Поле', label: 'Павлове Поле' },
  { value: 'Песочин', label: 'Пісочин' },
  { value: 'Покотиловка', label: 'Покотилівка' },
  { value: 'Полтавский Шлях', label: 'Полтавський Шлях' },
  { value: 'Пятихатки', label: 'П\'ятихатки' },
  { value: 'Рогань', label: 'Рогань' },
  { value: 'Салтовка', label: 'Салтівка' },
  { value: 'Сев.Салтовка', label: 'Північна Салтівка' },
  { value: 'Сортировка', label: 'Сортувальня' },
  { value: 'Хол.Гора', label: 'Холодна Гора' },
  { value: 'ХТЗ', label: 'ХТЗ' },
  { value: 'Шишковка', label: 'Шишківка' },
  { value: 'ЮВ и ЦР', label: 'ПВ і ЦР' }, 
  { value: 'Центр', label: 'Центр' }
].sort((a, b) => a.label.localeCompare(b.label, 'uk'))
